zhaohad/KeilProjects/STC8A8K64D4/自平衡自行车/src/mpu6500.h
#ifndef __MPU6500_H__
#define __MPU6500_H__

#include "typedef.h"
#include "stc8a_i2c.h"

#define MPU6500_P_SDA P_MPU6500_SDA
#define MPU6500_P_SCL P_MPU6500_SCL

#define	MPU_ADDR I2C_ADDR_MPU6500
#define Delay5us() _nop_();_nop_();_nop_();_nop_();_nop_();

//****************************************
// 定义MPU6050内部地址
//****************************************
#define	SMPLRT_DIV		0x19	//陀螺仪采样率，典型值：0x07(125Hz)
#define	CONFIG			0x1A	//低通滤波频率，典型值：0x06(5Hz)
#define	GYRO_CONFIG		0x1B	//陀螺仪自检及测量范围，典型值：0x18(不自检，2000deg/s)
#define	ACCEL_CONFIG	0x1C	//加速计自检、测量范围及高通滤波频率，典型值：0x01(不自检，2G，5Hz)
#define	ACCEL_XOUT_H	0x3B
#define	ACCEL_XOUT_L	0x3C
#define	ACCEL_YOUT_H	0x3D
#define	ACCEL_YOUT_L	0x3E
#define	ACCEL_ZOUT_H	0x3F
#define	ACCEL_ZOUT_L	0x40
#define	TEMP_OUT_H		0x41
#define	TEMP_OUT_L		0x42
#define	GYRO_XOUT_H		0x43
#define	GYRO_XOUT_L		0x44	
#define	GYRO_YOUT_H		0x45
#define	GYRO_YOUT_L		0x46
#define	GYRO_ZOUT_H		0x47
#define	GYRO_ZOUT_L		0x48
#define	PWR_MGMT_1		0x6B	//电源管理，典型值：0x00(正常启用)
#define	WHO_AM_I		0x75	//IIC地址寄存器(默认数值0x68，只读)

void MPU6500_Init();
int MPU6500_GetData(uchar REG_Address);
void MPI6500_GetGAData(float outV[6]);
void MPU6500_IMU_Update_arr(float v[6], float outAngle[2]);
void MPU6500_IMU_Update(float gx, float gy, float gz, float ax, float ay, float az, float *angleX, float *angleY);

#endif